researcher_name = input("Введите ФИО исследователя: ")
date = input("Введите дату (в формате ДД.ММ.ГГГГ): ")
experiment_name = input("Введите название эксперимента: ")
conclusion = input("Введите вывод эксперимента: ")

with open("journal.txt", "w", encoding="utf-8") as tablica:
    tablica.write(f"""+--------------------------------------------------+
| Электронный лабораторный журнал                  |
+--------------------------------------------------+
| ФИО исследователя : {researcher_name}    |
| Дата             : {date}                    |
| Эксперимент      : {experiment_name}     |
+--------------------------------------------------+
| Вывод:                                           |
| {conclusion}                                   | |
+--------------------------------------------------+""")